<script setup lang="ts"></script>
<template>
	<h1>Кристалл</h1>

	<ul>
		На схеме представлены:
		<li>
			Cлева вверху &mdash; прохождение световой волны произвольной (регулируемой) поляризации
			через пластину
			<NuxtLink to="/description#oneaxecrist">одноосного кристалла</NuxtLink> регулируемой
			ориентации и толщины (<NuxtLink to="/description#opticalaxe">оптическая ось</NuxtLink>
			лежит в плоскости пластины). Падающая на кристалл световая волна состоит из двух
			<NuxtLink to="/description#linepolar">линейно-поляризованных волн</NuxtLink> (на экране
			показан только результирующий вектор <TexI>\vec E)</TexI>, регулировка параметров
			которых аналогична регулировкам, используемым в разделе "Две волны". На кристалле
			показаны две взаимно перпендикулярные (главные) оси, одна из которых является
			<NuxtLink to="/description#opticalaxe">оптической осью</NuxtLink>.
		</li>
		<li>
			Справа вверху &mdash; закон изменения <TexI>\vec E</TexI> от времени на входе в кристалл
			и на выходе из кристалла (показано разложение вектора <TexI>\vec E</TexI> по главным
			осям кристалла), ось <TexI>Oy</TexI> направлена на наблюдателя.
		</li>
		<li>
			Внизу &mdash; закон изменения модуля
			<NuxtLink to="/description#umovpointing">вектора Умова-Пойнтинга</NuxtLink>&thinsp;
			<TexI>\vec S = [\vec E \times \vec H]</TexI> и его среднее значение
			<TexI text="<\!S\!>" /> в падающей и прошедшей волнах.
		</li>
	</ul>
</template>
<style scoped></style>
