<script setup lang="ts"></script>
<template>
	<dt id="elwave">Электромагнитная волна</dt>
	<dd>
		&mdash; это распространяющиеся в пространстве взаимно перпендикулярные электрическое
		<TexI>\vec E(\vec r, t)</TexI> и магнитное <TexI>\vec H(\vec r, t)</TexI> поля,
		удовлетворяющие системе уравнений Максвелла, причем направление распространения
		<TexI>\vec n</TexI> в каждой точке пространства перпендикулярно <TexI>\vec E</TexI> и
		<TexI>\vec H.</TexI>
	</dd>

	<hr />

	<dt id="lineelwave">Плоская монохроматическая бегущая электромагнитная волна</dt>
	<dd>
		<p>
			&mdash; это <NuxtLink href="#elwave">электромагнитная волна</NuxtLink>, в которой
			<TexI>\vec E-</TexI> и <TexI>\vec H-</TexI>компоненты поля меняются по одному и тому же
			гармоническому закону, а поверхность постоянной фазы является плоскостью. Например, для
			волны, распространяющейся в вакууме вдоль оси <TexI>Oy:</TexI>
			<TexI display>
				\begin{cases} E_z(y, t) = E_0 \cos (\omega t - ky) \\ H_x(y, t) = H_0 \cos(\omega t
				- ky), \end{cases}
			</TexI>
			где <TexI>\omega = 2\pi / T</TexI> &mdash; круговая частота колебаний,
			<TexI>T</TexI> &mdash; период колебаний, <TexI>k = 2\pi / \lambda </TexI> &mdash;
			волновое число, <TexI>\lambda</TexI> &mdash; длина волны.
		</p>
		<p>
			Для амплитуд <TexI>E_0</TexI> и <TexI>H_0</TexI> при распространении в вакууме
			справедливо соотношение:
			<TexI display> E_0 = c\mu_0 H_0, </TexI>
			где <TexI>c</TexI> &mdash; скрость света в вакууме.
		</p>
	</dd>

	<hr />

	<dt id="umovpointing">Вектор Умова-Пойнтинга <TexI>\vec S = [\vec E \times \vec H]</TexI></dt>
	&mdash; вектор, направление которого совпадает с направлением распространения энергии в
	<NuxtLink to="#elwave">электромагнитной волне</NuxtLink>, а модуль <TexI>|\vec S|</TexI> равен
	<NuxtLink to="#potok">потоку энергии</NuxtLink>.

	<hr />

	<dt id="potok">Поток энергии</dt>
	<dd>&mdash; энергия, проходящая в единицу времени через сечение единичной площади.</dd>

	<hr />

	<dt id="plotnost">Плотность энергии</dt>
	<dd>
		&mdash; энергия <NuxtLink to="#elwave"> электромагнитной волны</NuxtLink>, приходящаяся на
		единицу объема.
	</dd>

	<hr />

	<dt id="uzel">Узел</dt>
	<dd>&mdash; точка, в которой амплитуда поля в стоячей волне всегда равна нулю.</dd>

	<hr />

	<dt id="puchnost">Пучность</dt>
	<dd>&mdash; точка, в которой амплтуда поля в стоячей волне принимает максимальное значение.</dd>

	<hr />

	<dt id="ploskostpolarizacii">Плоскость поляризации</dt>
	<dd>
		&mdash; плоскость, задаваемая вектором напряженности электрического поля
		<TexI>\vec E</TexI> и вектором, указывающим направление распространения
		<NuxtLink to="#elwave">электромагнитной волны</NuxtLink>.
	</dd>

	<hr />

	<dt id="linepolar">Линейно поляризованная волна</dt>
	<dd>
		&mdash; волна, в любой точке которой вектор <TexI>\vec E</TexI> всегда лежит в одной
		плоскости (<NuxtLink to="#ploskostpolarizacii">плоскости поляризации</NuxtLink>).
	</dd>

	<hr />

	<dt id="circpolar">Циркулярно поляризованная волна</dt>
	<dd>
		&mdash; волна, в любой точке которой вектор <TexI>\vec E</TexI> вращается в плоскости,
		перпендикулярной направлению распространения, оставаясь неизменным по модулю.
	</dd>

	<hr />

	<dt id="ellippolar">Эллиптически поляризованная волна</dt>
	<dd>
		&mdash; волна, в любой точке которой вектор <TexI>\vec E</TexI> вращается в плоскости,
		перепендикулярной направлению распространения, причем конец вектора описывает эллипс.
	</dd>

	<hr />

	<dt id="leftpolar">Левополяризованная волна</dt>
	<dd>
		&mdash; волна, в любой точке которой вектор <TexI>\vec E</TexI> вращается против часовой
		стрелки (при наблюдении навстречу волне).
	</dd>

	<hr />

	<dt id="rightpolar">Правополяризованная волна</dt>
	<dd>
		&mdash; волна, влюбой точке которой вектор <TexI>\vec E</TexI> вращается по часовой стрелке
		(при наблюдении навстречу волне).
	</dd>

	<hr />

	<dt id="staywave">Стоячая волна</dt>
	<dd>
		&mdash; волна, формирующаяся при распространении двух
		<NuxtLink to="#lineelwave">плоских монохроматических электромагнитных волн</NuxtLink>
		одинаковой поляризации навстречу друг другу. Например, если вектор
		<TexI>\vec E</TexI> направлен вдоль оси <TexI>Oz</TexI> (<NuxtLink to="#ploskostpolarizacii"
			><TexI>zOy</TexI></NuxtLink
		>), вектор <TexI>\vec H</TexI> &mdash; вдоль оси <TexI>Ox</TexI>, а сама волна
		распространяется вдоль оси <TexI>Oy</TexI>, то в стоячей волне:
		<TexI display>
			\begin{cases} E_z(y, t) = E_0 \cos \omega t \cos ky \\ H_x(y,t) = H_0 \sin \omega t \sin
			k y, \end{cases}
		</TexI>
		т. е. вектор <TexI>\vec H</TexI> сдвинут по фазе на <TexI>\pi / 2</TexI> относительно
		вектора <TexI>\vec E</TexI> и во времени, и в пространстве.
	</dd>

	<hr />

	<dt id="opticalaxe">Оптическая ось кристалла</dt>
	<dd>
		&mdash; ось в кристалле, при распространении света вдоль которой не наблюдается явяления
		двойного лучепреломления, т.е. для излучения на выходе не изменяются ни направление
		распространения, ни поляризация.
	</dd>

	<hr />

	<dt id="oneaxecrist">Одноосный кристалл</dt>
	<dd>
		&mdash; кристалл, в котором имеется лишь одна
		<NuxtLink to="#opticalaxe">оптическая ось</NuxtLink>.
	</dd>

	<hr />

	<dt id="twoaxecrist">Двуосный кристалл</dt>
	<dd>
		&mdash; кристалл, в котором имеется две
		<NuxtLink to="#opticalaxe">оптические оси</NuxtLink>.
	</dd>

	<hr />

	<dt id="general">Главное сечение кристалла</dt>
	<dd>
		&mdash; плоскость, образованная направлением распространения падающего света и направлением
		<NuxtLink to="#opticalaxe">оптической оси</NuxtLink> кристалла.
	</dd>

	<hr />

	<dt id="owave">Обыкновенная волна</dt>
	<dd>
		&mdash; <NuxtLink to="#linepolar">линейно поляризованная</NuxtLink> волна,
		распространяющаяся в одноосном кристалле, и поляризованная в плоскости, перпендикулярной к
		<NuxtLink to="#general">главному сечению кристалла</NuxtLink>. Обыкновенная волна
		распространяется в кристалле во всех направлениях с одинаковой скоростью и характеризуется
		постянным значением показателя преломления, обозначаемым <TexI>n_0.</TexI>
	</dd>

	<hr />

	<dt id="ewave">Необыкновенная волна</dt>
	&mdash; <NuxtLink to="#linepolar">линейно поляризованная</NuxtLink> волна, распространяющаяся в
	одноосном кристалле, и поляризованная в плоскости, совпадающей с
	<NuxtLink to="#general">главным сечением кристалла</NuxtLink>. Для необыкновенной волны скорость
	распространения зависит от направления распространения для нее значение показателя преломления,
	максимально отличающееся от <TexI>n_0,</TexI> обозначается <TexI>n_e.</TexI>

	<hr />

	<dt id="pluscrist">Положительный кристалл</dt>
	<dd>&mdash; кристалл, для которого <TexI>n_e > n_0.</TexI></dd>

	<hr />

	<dt id="minuscrist">Отрицательный кристалл</dt>
	<dd>&mdash; кристалл, для которого <TexI text="n_e < n_0." /></dd>

	<hr />

	<dt id="l4">Пластинка <TexI>\lambda / 4</TexI></dt>
	<dd>
		&mdash; пластинка, которая при нормальном падении на нее световой волны вносит для
		<NuxtLink to="#owave">обыкновенной</NuxtLink> и
		<NuxtLink to="#ewave">необыкновенной</NuxtLink> волн дополнительную разность хода, равную
		<TexI>ml+l/4,</TexI> где <TexI>m \in \mathbb Z</TexI> (или дополнительную разность фаз
		<TexI>2\pi m + \pi / 2)</TexI>.
	</dd>

	<hr />

	<dt id="l2">Пластинка <TexI>\lambda / 2</TexI></dt>
	<dd>
		&mdash; пластинка, которая при нормальном падении на нее световой волны вносит для
		<NuxtLink to="#owave">обыкновенной</NuxtLink> и
		<NuxtLink to="#ewave">необыкновенной</NuxtLink> волн дополнительную разность хода, равную
		<TexI>ml+l/2,</TexI> где <TexI>m \in \mathbb Z</TexI> (или дополнительную разность фаз
		<TexI>2\pi m + \pi)</TexI>.
	</dd>
</template>
<style scoped></style>
